## Spearman Co-relation program

In [79]:
import pandas as pd
import numpy as np

In [80]:
maths = [30,33,45,23,8,49,12,4,31,30]
science = [35,23,47,17,10,43,9,6,28,20]

In [81]:
df = pd.DataFrame({"Maths":maths,"Science":science})
data = df.copy()
df

   Maths  Science
0     30       35
1     33       23
2     45       47
3     23       17
4      8       10
5     49       43
6     12        9
7      4        6
8     31       28
9     30       20

### 1. Sorting data w.r.t to "Maths"

In [82]:
df = df.sort_values(by="Maths").reset_index(drop=True)
df

   Maths  Science
0      4        6
1      8       10
2     12        9
3     23       17
4     30       35
5     30       20
6     31       28
7     33       23
8     45       47
9     49       43

### 2. Giving rank to "maths" feature

In [83]:
df["Maths_Rank"] = np.arange(1,len(df["Maths"])+1)

In [84]:
df

   Maths  Science  Maths_Rank
0      4        6           1
1      8       10           2
2     12        9           3
3     23       17           4
4     30       35           5
5     30       20           6
6     31       28           7
7     33       23           8
8     45       47           9
9     49       43          10

### 3. Assigning rank to "science"  feature.

In [85]:
marks = df["Science"].tolist()

In [86]:
num_rank = []

for i in range(len(marks)):
    a= min(marks)
    num_rank.append([a,i+1])
    marks.remove(a)

In [87]:
marks = df["Science"].tolist()
rank =[]

for i in marks:
    for j in num_rank:
        if i==j[0]:
            rank.append(j[1])
print(rank)

[1, 3, 2, 4, 8, 5, 7, 6, 10, 9]

In [88]:
df["Science_Rank"] = rank
df

   Maths  Science  Maths_Rank  Science_Rank
0      4        6           1             1
1      8       10           2             3
2     12        9           3             2
3     23       17           4             4
4     30       35           5             8
5     30       20           6             5
6     31       28           7             7
7     33       23           8             6
8     45       47           9            10
9     49       43          10             9

### 4. Adding Rank Differences

In [89]:
df["d"] = df["Maths_Rank"] - df["Science_Rank"]
#df["d"]

### 5. Getting difference square

In [90]:
df["d2"] = df["d"]**2

In [91]:
df

   Maths  Science  Maths_Rank  Science_Rank  d  d2
0      4        6           1             1  0   0
1      8       10           2             3 -1   1
2     12        9           3             2  1   1
3     23       17           4             4  0   0
4     30       35           5             8 -3   9
5     30       20           6             5  1   1
6     31       28           7             7  0   0
7     33       23           8             6  2   4
8     45       47           9            10 -1   1
9     49       43          10             9  1   1

### 6. Appling spearman formula.

In [92]:
sum_of_d2 = sum(df["d2"])
n = len(df["d2"])
n2 = n**2

In [93]:
corr = 1 - ((6*sum_of_d2)/(n*(n2-1)))

In [94]:
corr

0.8909090909090909

In [95]:
data.corr()

            Maths   Science
Maths    1.000000  0.934801
Science  0.934801  1.000000